In [1]:
import pandas as pd
sr=pd.Series([10,20,30,40,50])
print(sr)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [2]:
import pandas as pd
data=pd.array([10,20,30,40,50])
s=pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: Int64

In [3]:
import pandas as pd
data=pd.array(['a','b','c','d'])
s=pd.Series(data,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: string

In [4]:
data={'a':0,'b':1,'c':3}
s1=pd.Series(data,index=['a','b','c','d'])
s1

a    0.0
b    1.0
c    3.0
d    NaN
dtype: float64

In [7]:
df=pd.DataFrame({"Name":['Test','Demo','Admin','Jhon','Manager'],
                 "age":[10,20,30,40,50]})
df

      Name  age
0     Test   10
1     Demo   20
2    Admin   30
3     Jhon   40
4  Manager   50

In [17]:
dt={"Name":['Tom','Mark','Jackson','Jhon','Messi'],
                 "Age":pd.Series([10,20,30,40,50]),
    'Rating':pd.Series([4,5,6,3.24,6])}
dt


df=pd.DataFrame(dt)
df

      Name  Age  Rating
0      Tom   10    4.00
1     Mark   20    5.00
2  Jackson   30    6.00
3     Jhon   40    3.24
4    Messi   50    6.00

In [19]:
df.info()
df.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Rating  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

Name       object
Age         int64
Rating    float64
dtype: object

In [24]:
len(df)
df[['Age','Name']]
df.ndim
df.shape
df.size

15

In [21]:
df.describe()

             Age    Rating
count   5.000000  5.000000
mean   30.000000  4.848000
std    15.811388  1.222915
min    10.000000  3.240000
25%    20.000000  4.000000
50%    30.000000  5.000000
75%    40.000000  6.000000
max    50.000000  6.000000

In [25]:
df.values

array([['Tom', 10, 4.0],
       ['Mark', 20, 5.0],
       ['Jackson', 30, 6.0],
       ['Jhon', 40, 3.24],
       ['Messi', 50, 6.0]], dtype=object)

In [26]:
df.sum()

Name      TomMarkJacksonJhonMessi
Age                           150
Rating                      24.24
dtype: object

In [27]:
df.mean()

/tmp/ipykernel_5225/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age       30.000
Rating     4.848
dtype: float64

In [28]:
df.describe(include=['int64'])
df

      Name  Age  Rating
0      Tom   10    4.00
1     Mark   20    5.00
2  Jackson   30    6.00
3     Jhon   40    3.24
4    Messi   50    6.00